dependencies/axiom/1.2.11-wso2v5/modules/axiom-api/src/test/resources/soap/noprettyprint.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:usr="http://ws.apache.org/axis2/user"><soapenv:Header /><soapenv:Body><axis2:echoMyData xmlns:axis2="http://ws.apache.org/axis2"><data xsi:type="usr:myData">Hello World</data></axis2:echoMyData></soapenv:Body></soapenv:Envelope>